//Задача №8: Цикличный вывод данных на экран
//Необходимо с помощью цикла вывести на экран числа от 1 до 50.

import java.io.IOException;

public class Task8 {
    public static void main (String[] args) throws IOException {

        for (int x = 1; x < 51; x++) {
            System.out.println(x);
        }
    }
}
